In [12]:
import os
import pickle
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

In [3]:
src_train = os.path.join('Data', 'train.csv')
src_test = os.path.join('Data', 'test.csv')
src_gender_submission = os.path.join('Data', 'gender_submission.csv')

In [6]:
data = pd.read_csv(src_train)
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
X = data.drop(['Name', 'Survived', 'PassengerId', 'Ticket'], axis=1).values

In [13]:
data.drop(['Name', 'Survived', 'PassengerId', 'Ticket'], axis=1)

     Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         3    male  22.0      1      0   7.2500   NaN        S
1         1  female  38.0      1      0  71.2833   C85        C
2         3  female  26.0      0      0   7.9250   NaN        S
3         1  female  35.0      1      0  53.1000  C123        S
4         3    male  35.0      0      0   8.0500   NaN        S
..      ...     ...   ...    ...    ...      ...   ...      ...
886       2    male  27.0      0      0  13.0000   NaN        S
887       1  female  19.0      0      0  30.0000   B42        S
888       3  female   NaN      1      2  23.4500   NaN        S
889       1    male  26.0      0      0  30.0000  C148        C
890       3    male  32.0      0      0   7.7500   NaN        Q

[891 rows x 8 columns]

In [11]:
print(X)

[[3 'male' 22.0 ... 7.25 nan 'S']
 [1 'female' 38.0 ... 71.2833 'C85' 'C']
 [3 'female' 26.0 ... 7.925 nan 'S']
 ...
 [3 'female' nan ... 23.45 nan 'S']
 [1 'male' 26.0 ... 30.0 'C148' 'C']
 [3 'male' 32.0 ... 7.75 nan 'Q']]

In [18]:
si = SimpleImputer(missing_values=np.nan, strategy='median')
si.fit(X[:, [2, 5]])
X[:, [2, 5]] = si.transform(X[:, [2, 5]])